cmsis-svd/cmsis-svd/data/Atmel/ATSAME70Q19.svd
               <register>
                  <name>HSTDMASTATUS</name>
                  <description>Host DMA Channel Status Register (n = 1)</description>
                  <addressOffset>0x0C</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>CHANN_ENB</name>
                        <description>Channel Enable Status</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CHANN_ACT</name>
                        <description>Channel Active Status</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>END_TR_ST</name>
                        <description>End of Channel Transfer Status</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>END_BF_ST</name>
                        <description>End of Channel Buffer Status</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DESC_LDST</name>
                        <description>Descriptor Loaded Status</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BUFF_COUNT</name>
                        <description>Buffer Byte Count</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
            <register>
               <name>CTRL</name>
               <description>General Control Register</description>
               <addressOffset>0x0800</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RDERRE</name>
                     <description>Remote Device Connection Error Interrupt Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VBUSHWC</name>
                     <description>VBUS Hardware Control</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FRZCLK</name>
                     <description>Freeze USB Clock</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USBE</name>
                     <description>USBHS Enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UIMOD</name>
                     <description>USBHS Mode</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>UIMODSelect</name>
                        <enumeratedValue>
                           <name>HOST</name>
                           <description>The module is in USB Host mode.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DEVICE</name>
                           <description>The module is in USB Device mode.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SR</name>
               <description>General Status Register</description>
               <addressOffset>0x0804</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RDERRI</name>
                     <description>Remote Device Connection Error Interrupt (Host mode only)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPEED</name>
                     <description>Speed Status (Device mode only)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>SPEEDSelect</name>
                        <enumeratedValue>
                           <name>FULL_SPEED</name>
                           <description>Full-Speed mode</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH_SPEED</name>
                           <description>High-Speed mode</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOW_SPEED</name>
                           <description>Low-Speed mode</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CLKUSABLE</name>
                     <description>UTMI Clock Usable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCR</name>
               <description>General Status Clear Register</description>
               <addressOffset>0x0808</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RDERRIC</name>
                     <description>Remote Device Connection Error Interrupt Clear</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SFR</name>
               <description>General Status Set Register</description>
               <addressOffset>0x080C</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RDERRIS</name>
                     <description>Remote Device Connection Error Interrupt Set</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VBUSRQS</name>
                     <description>VBUS Request Set</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
